kilescg/nrf5-sdk-thread-zigbee/examples/zigbee/ota/experimental_server/main.c
ZB_ZCL_DECLARE_BASIC_ATTRIB_LIST(basic_attr_list,
                                 &m_dev_ctx.basic_attr.zcl_version,
                                 &m_dev_ctx.basic_attr.power_source);

ZB_ZCL_DECLARE_OTA_UPGRADE_ATTRIB_LIST_SERVER(ota_upgrade_attr_list,
                                              &m_dev_ctx.ota_attr.query_jitter,
                                              &m_dev_ctx.ota_attr.current_time,
                                              NUMBER_OF_UPGRADE_IMAGES);

/********************* Declare device **************************/

ZB_HA_DECLARE_OTA_UPGRADE_SERVER_CLUSTER_LIST(ota_upgrade_server_clusters,
                                              basic_attr_list,
                                              ota_upgrade_attr_list);

ZB_HA_DECLARE_OTA_UPGRADE_SERVER_EP(ota_upgrade_server_ep, OTA_ENDPOINT, ota_upgrade_server_clusters);

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
static zb_uint8_t   m_attr_zcl_version   = ZB_ZCL_VERSION;
static zb_uint8_t   m_attr_power_source  = ZB_ZCL_BASIC_POWER_SOURCE_UNKNOWN;
static zb_uint16_t  m_attr_identify_time = 0;


/* Declare attribute list for Identify cluster (client). */
ZB_ZCL_DECLARE_IDENTIFY_CLIENT_ATTRIB_LIST(identify_client_attr_list);

/* Declare attribute list for Identify cluster (server). */
ZB_ZCL_DECLARE_IDENTIFY_SERVER_ATTRIB_LIST(identify_server_attr_list, &m_attr_identify_time);

/* Declare attribute list for Basic cluster (client). */
ZB_ZCL_DECLARE_BASIC_CLIENT_ATTRIB_LIST(basic_client_attr_list);

/* Declare attribute list for Basic cluster (server). */
ZB_ZCL_DECLARE_BASIC_SERVER_ATTRIB_LIST(basic_server_attr_list, &m_attr_zcl_version, &m_attr_power_source);

/* Declare attribute list for Groups cluster (client). */
ZB_ZCL_DECLARE_GROUPS_CLIENT_ATTRIB_LIST(groups_client_attr_list);

/* Declare cluster list for CLI Agent device. */
ZB_HA_DECLARE_CONFIGURATION_TOOL_CLUSTER_LIST(cli_agent_clusters,
                                              basic_client_attr_list,
                                              basic_server_attr_list,
                                              identify_client_attr_list,
                                              identify_server_attr_list,
                                              groups_client_attr_list);

/* Declare endpoint for CLI Agent device. */
ZB_HA_DECLARE_CONFIGURATION_TOOL_EP(cli_agent_ep,
                                    ZIGBEE_CLI_ENDPOINT,
                                    cli_agent_clusters);

ZBOSS_DECLARE_DEVICE_CTX_2_EP(ota_upgrade_server_ctx, ota_upgrade_server_ep, cli_agent_ep);
#else /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */
ZB_HA_DECLARE_OTA_UPGRADE_SERVER_CTX(ota_upgrade_server_ctx, ota_upgrade_server_ep);
#endif /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */

#ifdef SOFTDEVICE_PRESENT
/* Forward declaration of functions controlling BLE DFU transport. */
uint32_t ble_dfu_transport_init(nrf_dfu_observer_t observer);
uint32_t ble_dfu_transport_close(nrf_dfu_transport_t const * p_exception);
#endif

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing scheduler module.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/**@brief Function for initializing the Power Driver.
 */
static void power_driver_init(void)
{
    ret_code_t err_code;
    err_code = nrf_drv_power_init(NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing all clusters attributes.
 */
static void ota_server_attr_init(void)
{
    /* Basic cluster attributes data */
    m_dev_ctx.basic_attr.zcl_version  = ZB_ZCL_VERSION;
    m_dev_ctx.basic_attr.power_source = ZB_ZCL_BASIC_POWER_SOURCE_UNKNOWN;

    /* OTA cluster attributes data */
    m_dev_ctx.ota_attr.query_jitter = ZB_ZCL_OTA_UPGRADE_QUERY_JITTER_MAX_VALUE;
    m_dev_ctx.ota_attr.current_time = OTA_UPGRADE_TEST_CURRENT_TIME;
}

/**@brief This callback is called on next image block request
 *
 * @param index  file index
 * @param offset current offset of the file
 * @param size   block size
 */
static zb_ret_t next_data_ind_cb(zb_uint8_t index,
                                 zb_zcl_parsed_hdr_t *zcl_header,
                                 zb_uint32_t offset,
                                 zb_uint8_t size,
                                 zb_uint8_t** data)
{
    ZVUNUSED(zcl_header);

    *data = ((zb_uint8_t *)mp_ota_file + offset);

    return RET_OK;
}

/**@brief Function for checking if a new Zigbee image is present at given address.
 *
 * @params[in] p_ota_file  Pointer to the memory, where Zigbee OTA image starts.
 *
 * @returns true if a valid image is found, false otherwise.
 */
static bool ota_file_sanity_check(ota_upgrade_test_file_t * p_ota_file)
{
    if (p_ota_file->head.file_id != ZB_ZCL_OTA_UPGRADE_FILE_HEADER_FILE_ID)
    {
        bsp_board_led_off(OTA_IMAGE_PRESENT_LED);
        return false;
    }
    else
    {
        bsp_board_led_on(OTA_IMAGE_PRESENT_LED);
        return true;
    }
}

static void insert_ota_file(zb_bufid_t bufid)
{
    zb_ret_t zb_err_code;

    /* The function assumes that at the UPGRADE_IMAGE_OFFSET address the correct OTA upgrade file can be found */
    ZB_ZCL_OTA_UPGRADE_INSERT_FILE(bufid, OTA_ENDPOINT, 0, (zb_uint8_t *)(mp_ota_file), OTA_UPGRADE_TEST_UPGRADE_TIME, ZB_TRUE, zb_err_code);
    ZB_ERROR_CHECK(zb_err_code);
#ifdef SOFTDEVICE_PRESENT
    m_ota_file_inserted = true;
#endif
}

#ifdef SOFTDEVICE_PRESENT
static void remove_ota_file(zb_bufid_t bufid)
{
    zb_ret_t zb_err_code;

    if (!m_ota_file_inserted)
    {
        return;
    }

    ZB_ZCL_OTA_UPGRADE_REMOVE_FILE(bufid, OTA_ENDPOINT, 0, zb_err_code);
    ZB_ERROR_CHECK(zb_err_code);
    bsp_board_led_off(OTA_IMAGE_PRESENT_LED);
    m_ota_file_inserted = false;
}

