kilescg/nrf5-sdk-thread-zigbee/examples/zigbee/ota/experimental_server/main.c
/**@brief Function for reseting the OTA server. After update, the background DFU
 *        bootloader will apply the new firmware.
 *
 * @param[in]   bufid   Not used. Required by callback type definition.
 */
static void reset_ota_server(zb_bufid_t bufid)
{
    if (bufid)
    {
        zb_buf_free(bufid);
    }

    NRF_LOG_FINAL_FLUSH();
    NVIC_SystemReset();
}

/**@brief Function for handling a self-upgrade DFU process.
 *
 * @details Cannot close transport directly form event context, as it is called
 *          directly from softdevice event and disabling softdevice (by closing
 *          BLE transport) in an softdevice-interrupt context is prohibited.
 **/
static void ble_transport_disable(void * p_event_data, uint16_t event_size)
{
    UNUSED_PARAMETER(p_event_data);
    UNUSED_PARAMETER(event_size);

    UNUSED_RETURN_VALUE(ble_dfu_transport_close(NULL));
}

/**@brief Function notifies certain events in DFU process. */
static void dfu_observer(nrf_dfu_evt_type_t event)
{
    static bool dfu_image_valid      = false;
    static bool ble_transport_active = false;
    zb_ret_t    zb_err_code;

    switch (event)
    {
        case NRF_DFU_EVT_TRANSPORT_DEACTIVATED:
            if (ota_file_sanity_check(mp_ota_file))
            {
                NRF_LOG_INFO("BLE peer successfully disconnected.");
            }
            else
            {
                NRF_LOG_INFO("BLE transport deactivated.");
                ble_transport_active = false;

                if (dfu_image_valid)
                {
                    NRF_LOG_INFO("New firmware for OTA server accepted. Reset device.");
                    UNUSED_RETURN_VALUE(ZB_SCHEDULE_APP_CALLBACK(reset_ota_server, 0));
                }
            }
            break;

        case NRF_DFU_EVT_DFU_INITIALIZED:
            break;

        case NRF_DFU_EVT_TRANSPORT_ACTIVATED:
            ble_transport_active = true;
            break;

        case NRF_DFU_EVT_DFU_STARTED:
            NRF_LOG_INFO("BLE image transfer started.");
            NRF_LOG_INFO("Store new image at 0x%08x", mp_ota_file);

            // A new Zigbee image is going to be transferred over BLE and will overwrite current image contents.
            // Invalidate current image, so any ongoing Zigbee DFU process will be aborted by OTA server.
            zb_err_code = zb_buf_get_out_delayed(remove_ota_file);
            ZB_ERROR_CHECK(zb_err_code);

            bsp_board_led_on(BLE_OTA_ACTIVITY_LED);
            dfu_image_valid = false;
            break;

        case NRF_DFU_EVT_OBJECT_RECEIVED:
            bsp_board_led_invert(BLE_OTA_ACTIVITY_LED);
            break;

        case NRF_DFU_EVT_DFU_FAILED:
        case NRF_DFU_EVT_DFU_ABORTED:
            NRF_LOG_WARNING("BLE image transfer stopped with errors. Reason: %d.", event);
            bsp_board_led_off(BLE_OTA_ACTIVITY_LED);
            break;

        case NRF_DFU_EVT_DFU_COMPLETED:
            NRF_LOG_INFO("BLE image transferred completed. Zigbee image: %s", (ota_file_sanity_check(mp_ota_file) ? "true" : "false"));

            // Check if Zigbee image was received.
            if (ota_file_sanity_check(mp_ota_file))
            {
                if (!m_external_app_valid)
                {
                    NRF_LOG_INFO("New Zigbee image dropped due to previous validation failures.");
                    bsp_board_led_off(OTA_IMAGE_PRESENT_LED);
                    break;
                }
                else
                {
                    dfu_image_valid = true;
                }

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
                if (zb_cli_is_stack_started() && ZB_JOINED())
#else
                if (ZB_JOINED())
#endif
                {
                    NRF_LOG_INFO("Insert new Zigbee image to the OTA server.");
                    zb_err_code = zb_buf_get_out_delayed(insert_ota_file);
                    if (zb_err_code != RET_OK)
                    {
                        NRF_LOG_WARNING("New image not inserted due to lack of Zigbee memory buffers.");
                    }
                }
                else
                {
                    NRF_LOG_INFO("Inserting new Zigbee image postponed. Waiting for the device to join Zigbee network.");
                }

                /* Disconnect from the peer. */
                ret_code_t err_code = ble_dfu_transport_disconnect();
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("Unable to disconnect from the BLE DFU peer. Status: %d", err_code);
                }
            }
            else
            {
                NRF_LOG_INFO("New firmware for OTA server downloaded.");
                dfu_image_valid = true;

                if (ble_transport_active)
                {
                    NRF_LOG_INFO("Disconnect from BLE peer.");
                    UNUSED_RETURN_VALUE(app_sched_event_put(NULL, 0, ble_transport_disable));
                }
                else
                {
                    NRF_LOG_INFO("Reset device.");
                    UNUSED_RETURN_VALUE(ZB_SCHEDULE_APP_CALLBACK(reset_ota_server, 0));
                }
            }
            break;

        default:
            NRF_LOG_INFO("Unhandled BLE DFU event: %d", event);
            break;
    }
}

nrf_dfu_result_t nrf_dfu_validation_post_external_app_execute(dfu_init_command_t const * p_init, bool is_trusted)
{
    NRF_LOG_INFO("Executing nrf_dfu_validation_post_external_app_execute\r\n");

    (void)p_init;
    (void)is_trusted;

    if (ota_file_sanity_check(mp_ota_file))
    {
        m_external_app_valid = true;
        NRF_LOG_INFO("Downloaded image is valid.");
        return NRF_DFU_RES_CODE_SUCCESS;
    }
    else
    {
        m_external_app_valid = false;
        NRF_LOG_INFO("Downloaded image is invalid.");
        return NRF_DFU_RES_CODE_INVALID;
    }
}
#endif

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
/**@brief Function to handle identify notification events.
 *
 * @param[IN]   param   Parameter handler is called with.
 */
static void identify_handler(zb_uint8_t param)
{
    if (param)
    {
        NRF_LOG_INFO("Start identifying.");
    }
    else
    {
        NRF_LOG_INFO("Stop identifying.");
    }
}
#endif /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */

void zboss_signal_handler(zb_bufid_t bufid)
{
    zb_zdo_app_signal_hdr_t  * p_sg_p = NULL;
    zb_zdo_app_signal_type_t   sig    = zb_get_app_signal(bufid, &p_sg_p);
    zb_ret_t                   status = ZB_GET_APP_SIGNAL_STATUS(bufid);

    /* Update network status LED */
    zigbee_led_status_update(bufid, ZIGBEE_NETWORK_STATE_LED);

    switch(sig)
    {
        case ZB_BDB_SIGNAL_DEVICE_REBOOT:
            /* fall-through */
        case ZB_BDB_SIGNAL_STEERING:
            /* Call default signal handler. */
            ZB_ERROR_CHECK(zigbee_default_signal_handler(bufid));

