kilescg/nrf5-sdk-thread-zigbee/examples/zigbee/ota/experimental_server/main.c
            if (status == RET_OK)
            {
#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
                if (sig != ZB_BDB_SIGNAL_STEERING)
                {
                    UNUSED_RETURN_VALUE(bdb_start_top_level_commissioning(ZB_BDB_NETWORK_STEERING));
                }
#endif /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */

                /* Look for the zigbee image file header. */
                if (ota_file_sanity_check(mp_ota_file))
                {
#ifdef SOFTDEVICE_PRESENT
                    /* Check if the whole zigbee image was received by the device
                     * before advertising it as a new, valid zigbee image.
                     *
                     * NOTE: Normally checking the bank code value is enough to
                     *       validate image, although there is one exception:
                     *       if the device did not reset between receiving an image
                     *       and joininng the zigbee network, the bank code value is still
                     *       not updated (done only by the bootloader code).
                     *       In such situation it is enough to check m_external_app_valid
                     *       flag value, as it can be set to true only by the DFU, at the post
                     *       validation phase.
                     */
                    if ((!nrf_dfu_validation_valid_external_app()) && (!m_external_app_valid))
                    {
                        NRF_LOG_INFO("DFU validation failed (incorrect bank code). Drop zigbee image.");
                        bsp_board_led_off(OTA_IMAGE_PRESENT_LED);
                        break;
                    }
                    else
#endif
                    {
                        NRF_LOG_INFO("New zigbee image found. Schedule image insertion.");
                        UNUSED_RETURN_VALUE(ZB_SCHEDULE_APP_ALARM(insert_ota_file, bufid, ZIGBEE_OTA_IMAGE_NOTIFY_DELAY));
                        bufid = 0;
                    }
                }
                else
                {
                    NRF_LOG_INFO("No zigbee image found inside internal flash.");
                }
            }

            break;

        default:
            /* Call default signal handler. */
            ZB_ERROR_CHECK(zigbee_default_signal_handler(bufid));
            break;
    }

    if (bufid)
    {
        zb_buf_free(bufid);
    }
}


int main(void)
{
    zb_ieee_addr_t ieee_addr;
    ret_code_t     ret = NRF_SUCCESS;

    UNUSED_VARIABLE(ret);

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) && ZIGBEE_OTA_SERVER_USE_CLI && defined(APP_USBD_ENABLED) && APP_USBD_ENABLED
    ret = nrf_drv_clock_init();
    APP_ERROR_CHECK(ret);
    nrf_drv_clock_lfclk_request(NULL);
#endif

    /* Initialize timers, logging and LEDs */
    timers_init();
    log_init();
    bsp_board_init(BSP_INIT_LEDS);
    scheduler_init();
    power_driver_init();

#ifdef SOFTDEVICE_PRESENT
    /* Initialize DFU module. */
    UNUSED_RETURN_VALUE(nrf_dfu_settings_init(true));
    UNUSED_RETURN_VALUE(nrf_dfu_req_handler_init(dfu_observer));

    /* Initialize BLE DFU transport and start advertising. */
    ret = ble_dfu_transport_init(dfu_observer);
    APP_ERROR_CHECK(ret);
#endif

    uint32_t bootloader_addr_actual   = BOOTLOADER_ADDRESS;
    uint32_t bootloader_addr_expected = BOOTLOADER_START_ADDR;

    /* Check if bootloader start address is consistent with UICR register contents. */
    if ((bootloader_addr_expected != bootloader_addr_actual) && (bootloader_addr_actual != 0xFFFFFFFF))
    {
        NRF_LOG_ERROR("Incorrect bootloader start address. Set BOOTLOADER_START_ADDR to 0x%x", BOOTLOADER_ADDRESS);
        NRF_LOG_FINAL_FLUSH();
        ASSERT(0);
    }

    /* Sanity check for the OTA Upgrade file */
    mp_ota_file = (ota_upgrade_test_file_t *)(UPGRADE_IMAGE_OFFSET);
    if (!ota_file_sanity_check(mp_ota_file))
    {
#ifndef SOFTDEVICE_PRESENT
        // There is no way to obtain a correct Zigbee OTA firmware - halt.
        for(;;);
#endif
    }

    /* Set Zigbee stack logging level and traffic dump subsystem. */
    ZB_SET_TRACE_LEVEL(ZIGBEE_TRACE_LEVEL);
    ZB_SET_TRACE_MASK(ZIGBEE_TRACE_MASK);
    ZB_SET_TRAF_DUMP_OFF();

    /* Initialize the attributes */
    ota_server_attr_init();

    ZB_INIT("ota_server");

    /* Set device address to the value read from FICR registers. */
    zb_osif_get_ieee_eui64(ieee_addr);
    zb_set_long_address(ieee_addr);

    zb_set_network_router_role(IEEE_CHANNEL_MASK);
    zb_set_max_children(MAX_CHILDREN);
    zigbee_erase_persistent_storage(ERASE_PERSISTENT_CONFIG);
    zb_set_keepalive_timeout(ZB_MILLISECONDS_TO_BEACON_INTERVAL(3000));

    /* Register OTA Client device context (endpoints). */
    ZB_AF_REGISTER_DEVICE_CTX(&ota_upgrade_server_ctx);

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
    /* Register handlers to identify notifications */
    ZB_AF_SET_IDENTIFY_NOTIFICATION_HANDLER(CLI_AGENT_ENDPOINT, identify_handler);
#endif /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */

    zb_zcl_ota_upgrade_init_server(OTA_ENDPOINT, next_data_ind_cb);

#if defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1)
    /* Initialize the Zigbee CLI subsystem */
    zb_cli_init(CLI_AGENT_ENDPOINT);

    /* Set the endpoint receive hook */
    ZB_AF_SET_ENDPOINT_HANDLER(CLI_AGENT_ENDPOINT, cli_agent_ep_handler);

    /* Start Zigbee CLI subsystem. */
    zb_cli_start();

    /* Start Zigbee stack. */
    while(1)
    {
        if (zb_cli_is_stack_started())
        {
#ifdef ZIGBEE_CLI_DEBUG
            if (!zb_cli_stack_is_suspended())
            {
                zboss_main_loop_iteration();
            }
#else
            zboss_main_loop_iteration();
#endif
        }
        app_sched_execute();
        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
        UNUSED_RETURN_VALUE(zb_cli_process());
    }
#else /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */
    zb_ret_t zb_err_code = zboss_start_no_autostart();
    ZB_ERROR_CHECK(zb_err_code);
    while(1)
    {
        zboss_main_loop_iteration();
        app_sched_execute();
        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    }
#endif /* defined(ZIGBEE_OTA_SERVER_USE_CLI) && (ZIGBEE_OTA_SERVER_USE_CLI == 1) */
}
